cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/services"
tap "antoniorodr/memo"
tap "artginzburg/tap"
tap "openhue/cli"
tap "oven-sh/bun"
tap "steipete/tap"

# Mac App Store CLI
brew "mas"

# Shell & Terminal
brew "fish"
brew "atuin", restart_service: :changed
brew "tmux"
brew "nano"
brew "nanorc"
brew "vim"
brew "mosh"

# Development
brew "gh"
brew "go"
brew "node"
brew "php"
brew "pyenv"
brew "typescript"
brew "uv"
brew "xcodegen"
brew "oven-sh/bun/bun"

# Networking & Security
brew "iperf3"
brew "ipcalc"
brew "nmap"
brew "ssh-copy-id"
brew "wget"
brew "websocat"

# Media
brew "exiftool"
brew "ffmpeg"
brew "handbrake", link: false
brew "imagemagick"
brew "pngquant"
brew "whisper-cpp"
brew "yt-dlp"

# System & Utilities
brew "ansible"
brew "coreutils"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "lzip"
brew "mactop"
brew "pandoc"
brew "pkgconf"
brew "qemu"
brew "toilet"
brew "transmission-cli"
brew "tree"
brew "unar"

# Third-party taps
brew "antoniorodr/memo/memo"
brew "artginzburg/tap/sudo-touchid"
brew "openhue/cli/openhue-cli"
brew "steipete/tap/summarize"

# Applications
cask "1password"
cask "affinity"
cask "alfred"
cask "bartender"
cask "bbedit"
cask "bettertouchtool"
cask "blackhole-2ch"
cask "chatbox"
cask "claude-code"
cask "codex"
cask "codexbar"
cask "discord"
cask "docker-desktop"
cask "fantastical"
cask "google-chrome"
cask "handbrake-app"
cask "istat-menus"
cask "jordanbaird-ice"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "rocket"
cask "screens"
cask "sonos"
cask "spotify"
cask "swiftbar"
cask "tailscale-app"
cask "timemachineeditor"
cask "transmission"
cask "utm"

# Fonts
cask "font-lora"
cask "font-source-serif-4"

# Mac App Store
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Apple Configurator", id: 1037126344
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Craft", id: 1487937127
mas "Dark Noise", id: 1465439395
mas "Data Jar", id: 1453273600
mas "Day One", id: 1055511498
mas "Final Cut Pro", id: 424389933
mas "GarageBand", id: 682658836
mas "HazeOver", id: 430798174
mas "Hush", id: 1544743900
mas "Hyperspace", id: 6739505345
mas "iMovie", id: 408981434
mas "Infuse", id: 1136220934
mas "Ivory", id: 6444602274
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "Mela", id: 1568924476
mas "Microsoft To Do", id: 1274495053
mas "Model 15", id: 1041465860
mas "Model D", id: 1339418001
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "One Thing", id: 1604176982
mas "Pages", id: 409201541
mas "Parcel Classic", id: 639968404
mas "PastePal", id: 1503446680
mas "Patterns", id: 429449079
mas "PCalc", id: 403504866
mas "Perplexity", id: 6714467650
mas "Pixelmator Pro", id: 1289583905
mas "Prompt", id: 1594420480
mas "Reeder", id: 1529448980
mas "Remote Desktop", id: 409907375
mas "Save to Reader", id: 1640236961
mas "Shareshot", id: 6474271573
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "stoic", id: 1312926037
mas "Structured", id: 1499198946
mas "Swift Playground", id: 1496833156
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Timery", id: 1425368544
mas "Tot", id: 1491071483
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
mas "Wipr", id: 1662217862
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
