cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

brew "mas"
mas "Tweetbot", id: 1384080005
mas "Super Agent", id: 1568262835
mas "Xcode", id: 497799835
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "PCalc", id: 403504866
mas "Spark", id: 1176895641
mas "Craft", id: 1487937127
mas "Hush", id: 1544743900
mas "Reeder", id: 1529448980
mas "Parcel", id: 639968404
mas "1Blocker", id: 1365531024
mas "Things", id: 904280696
mas "Microsoft Remote Desktop", id: 1295203466
mas "OneDrive", id: 823766827
mas "macOS Server", id: 883878097
mas "Apple Remote Desktop", id: 409907375

cask "1Password"
cask "aerial"
cask "alfred"
cask "bartender"
cask "bettertouchtool"
cask "docker"
cask "google-chrome"
cask "google-drive-file-stream"
cask "fantastical"
cask "istat-menus"
cask "keyboard-maestro"
cask "microsoft-office"
cask "nova"
cask "rocket"
cask "spotify"
cask "wireshark"


brew "python"
brew "coreutils"
brew "exiftool"
brew "ffmpeg"
brew "fish"
brew "handbrake"
brew "iperf3"
brew "mosh"
brew "nano"
brew "nmap"
brew "node"
brew "ssh-copy-id"
brew "tmux"
brew "tree"
brew "vim"
brew "wireshark", link: false
brew "youtube-dl"
